In [2]:
import pandas as pd

In [3]:
nomes = ['Ana', 'Bruno', 'Carla']
idades = [21, 20, 22]
dados = list(zip(nomes, idades))
dados

[('Ana', 21), ('Bruno', 20), ('Carla', 22)]

In [12]:
colunas = ['Nome', 'Idade']
linhas = ['A', 'B', 'C']
df = pd.DataFrame(data=dados, columns=colunas, index=linhas)
df

    Nome  Idade
A    Ana     21
B  Bruno     20
C  Carla     22

In [5]:
dados = {
    'Nome': ['Ana', 'Bruno', 'Carla'],
    'Idade': [21, 20, 22]
    }

df = pd.DataFrame(data = dados)
df

    Nome  Idade
0    Ana     21
1  Bruno     20
2  Carla     22

In [6]:
df.columns

Index(['Nome', 'Idade'], dtype='object')

In [7]:
df.dtypes

Nome     object
Idade     int64
dtype: object

In [14]:

df

    Nome  Idade
A    Ana     21
B  Bruno     20
C  Carla     22

In [20]:
df['Email'] = ['email1', 'email2', 'email3']
df

    Nome  Idade   Email
A    Ana     21  email1
B  Bruno     20  email2
C  Carla     22  email3

In [21]:
df['Salario'] = [1000, 2000, 1500]
df

    Nome  Idade   Email  Salario
A    Ana     21  email1     1000
B  Bruno     20  email2     2000
C  Carla     22  email3     1500

In [23]:
df['Gasto'] = [300, 400, 450]
df

    Nome  Idade   Email  Salario  Gasto
A    Ana     21  email1     1000    300
B  Bruno     20  email2     2000    400
C  Carla     22  email3     1500    450

In [25]:
df['Total'] = df['Salario'] - df['Gasto']
df

    Nome  Idade   Email  Salario  Gasto  Total
A    Ana     21  email1     1000    300    700
B  Bruno     20  email2     2000    400   1600
C  Carla     22  email3     1500    450   1050

### Exercicio

In [27]:
import pandas as pd

dados_alunos = {
    'Nome': ['Ana', 'Bruno', 'Carla'],
    'Nota1': [8.5, 7.0, 9.0],
    'Nota2': [9.5, 8.0, 9.5]
}

In [29]:
df = pd.DataFrame(data = dados_alunos)
df

    Nome  Nota1  Nota2
0    Ana    8.5    9.5
1  Bruno    7.0    8.0
2  Carla    9.0    9.5

In [34]:
df['Soma'] = df['Nota1'] + df['Nota2']
df['Media'] = df['Soma'] / 2
df

    Nome  Nota1  Nota2  Media  Soma
0    Ana    8.5    9.5   9.00  18.0
1  Bruno    7.0    8.0   7.50  15.0
2  Carla    9.0    9.5   9.25  18.5

In [37]:
df['Nome'][2]

'Carla'